'''
公鸡一只5元，母鸡一只3元，小鸡3只1元，100元买100只鸡，公鸡，母鸡，小鸡数量各是多少
'''
'''
公鸡、母鸡、小鸡数量分别为X,Y,Z
'''
#方法1 枚举法
n = 0 
#公鸡的数量100元全部购买公鸡，购买20只
for x in range(21):
    #母鸡的数量  100元购买，只够33只
    for y in range(34):

        z = 100 - x - y 
        if 5 * x + 3 * y + z / 3 == 100:
            print(f"公鸡{x}只,母鸡{y}只,小鸡{z}只")
            n += 1 
print(f"一共有{n}种买法")

#公式推导法
'''
x + y + z = 100
5x + 3y + z/3 = 10 
y = 25 - 7 * x / 4
'''
'''
x 是4的倍数
0<=7/4x <= 25, 即 0 <= x <= 14
y = 25 - 7/4 x
'''
n = 0
for x in range(0, 14, 4):
    y = 25 - 7 * x / 4
    z = 100 - x - y
    if 5 * x + 3 * y + z / 3 == 100:
        print(f'公鸡{x}只，母鸡{y}只，小鸡{z}只')
        n += 1
print(f'一共有{n}种买法')



























